1. Атамалар:
Маълумотлар (дата) - ёзиш ва қайта ишлаш мумкин бўлган маълумотлар, сонлар, матнлар ёки ҳар қандай маълумот.
Маълумотлар базаси (database) - махсус дастур ёрдамида сақланадиган ва бошқариладиган маълумотларнинг тартибга солинган тўплами.
Релятсион маълумотлар базаси (relational database) - маълумотлар ўзаро боғлиқ жадваллар кўринишида ташкил этилган маълумотлар базаси.
Жадвал (table) - Excel дастуридагига ўхшаш, маълумотларни сатр ва устунлар шаклида сақлаш учун мўлжалланган тузилма. Ҳар бир сатр - ёзув, ҳар бир устун эса - маълум турдаги маълумотларга эга майдон ҳисобланади.

2. "SQL Сервер"нинг бешта асосий хусусияти:
Кучли хавфсизлик тизими - шифрлаш, кириш назорати ва аудит.
Юқори самарадорлик - In-Memory OLTP, Columnstore каби ақлли оптимизаторлар.
Узлуксиз ишлаш ва тиклаш - Always On технологияси ва захиралаш.
Интеграллашган BI ва аналитика - SSIS, SSAS, SSRS, ML ва Power BI.
Гибридли ва булутли ечимлар - Azure, PolyBase, Synapse.

3. "SQL Сервер"да аутентификатсия усуллари:
Windows Authentication - кириш учун Windows аккаунтидан фойдаланади.
SQL Server Authentication - SQL Server ичида яратилган логин ва паролдан фойдаланади.

4. CREATE DATABASE SchoolDB

5. CREATE TABLE Students (StudentID INT PRIMARY KEY, Name VARCHAR(50), Age INT)

6. SQL Server, SSMS ва SQL ўртасидаги фарқлар
SQL (Структуралаштирилган сўров тили) - маълумотлар базаси билан ишлаш учун мўлжалланган дастурлаш тили хисобланади.
SQL Server - Microsoft компанияси томонидан ишлаб чиқилган маълумотлар базасини бошқариш тизимидир (MББT).
SSMS (SQL Server Management Studio) - SQL Server билан ишлаш учун яратилган дастур.

7. SQL буйруқларининг тоифалари:
DQL (Data Query Language) - маълумотларни ажратиб олиш. Мисол учун: SELECT.
DDL (Data Definition Language) - маълумотларни таҳрирлаш. Мисол учун: INSERT, UPDATE, DELETE.
DML (Data Manipulation Language) - жадвалларни бошқариш. Мисол учун: CREATE, ALTER, DROP.
DCL (Data Control Language) - фойдаланиш хуқуқларини бошқариш. Мисол учун: GRANT, REVOKE, DENY.
ТCЛ (Transaction Control Language) - транзаксияларни бошқариш. Мисол учун: BEGIN TRANSACTION, COMMIT, ROLLBACK, SAVEPOINT.

8. INSERT INTO Students VALUES (1, 'Ботиржон', 19), (2, 'Абдулазиз', 23), (3, 'Илхом', 48), (4, 'Дилшод', 39)

9. AdventureWorksDW2022 маълумотлар базасини тиклаш:
1-қадам: Захира нусхаси файлини юклаймиз.
2-қадам: SSMS дастурини ишга туширамиз.
3-қадам: "Object Explorer" ойнасида "Databases" жилдини топиб, унинг устига сичқончанинг ўнг тугмаси билан босамиз.
4-қадам: "Restore Database..." бандини танлеймиз.
5-қадам: Очилган ойнада "Device" (қурилма) бандини танлаб, уч нуқтали тугмани босамиз [...].
6-қадам: "Add" (қўшиш) тугмасини босиб, компьютеримизга юкланган AdventureWorksDW2022.bak файлини топамиз.
7-қадам: AdventureWorksDW2022.bak файлини танлаб тасдиқлаш тугмаси яъни "ОК"ни босамиз.
9-қадам: Тиклаш жараёнини бошлаш учун "ОК" тугмасини босамиз.
